{"keras_version": "1.2.0", "class_name": "Sequential", "config": [{"class_name": "Convolution2D", "config": {"init": "glorot_uniform", "subsample": [1, 1], "W_constraint": null, "trainable": true, "name": "convolution2d_76", "border_mode": "same", "activity_regularizer": null, "nb_col": 7, "batch_input_shape": [null, 48, 48, 3], "nb_filter": 32, "dim_ordering": "tf", "bias": true, "input_dtype": "float32", "W_regularizer": null, "activation": "linear", "b_constraint": null, "b_regularizer": null, "nb_row": 7}}, {"class_name": "Activation", "config": {"activation": "relu", "trainable": true, "name": "activation_112"}}, {"class_name": "Convolution2D", "config": {"init": "glorot_uniform", "subsample": [1, 1], "W_constraint": null, "trainable": true, "name": "convolution2d_77", "border_mode": "valid", "activity_regularizer": null, "nb_col": 7, "nb_filter": 64, "dim_ordering": "tf", "bias": true, "W_regularizer": null, "activation": "linear", "b_constraint": null, "b_regularizer": null, "nb_row": 7}}, {"class_name": "BatchNormalization", "config": {"gamma_regularizer": null, "epsilon": 0.001, "mode": 0, "trainable": true, "name": "batchnormalization_49", "axis": -1, "beta_regularizer": null, "momentum": 0.99}}, {"class_name": "Activation", "config": {"activation": "relu", "trainable": true, "name": "activation_113"}}, {"class_name": "MaxPooling2D", "config": {"strides": [2, 2], "dim_ordering": "tf", "trainable": true, "name": "maxpooling2d_46", "border_mode": "valid", "pool_size": [2, 2]}}, {"class_name": "Convolution2D", "config": {"init": "glorot_uniform", "subsample": [1, 1], "W_constraint": null, "trainable": true, "name": "convolution2d_78", "border_mode": "same", "activity_regularizer": null, "nb_col": 7, "nb_filter": 64, "dim_ordering": "tf", "bias": true, "W_regularizer": null, "activation": "linear", "b_constraint": null, "b_regularizer": null, "nb_row": 7}}, {"class_name": "BatchNormalization", "config": {"gamma_regularizer": null, "epsilon": 0.001, "mode": 0, "trainable": true, "name": "batchnormalization_50", "axis": -1, "beta_regularizer": null, "momentum": 0.99}}, {"class_name": "Activation", "config": {"activation": "relu", "trainable": true, "name": "activation_114"}}, {"class_name": "Convolution2D", "config": {"init": "glorot_uniform", "subsample": [1, 1], "W_constraint": null, "trainable": true, "name": "convolution2d_79", "border_mode": "same", "activity_regularizer": null, "nb_col": 5, "nb_filter": 64, "dim_ordering": "tf", "bias": true, "W_regularizer": null, "activation": "linear", "b_constraint": null, "b_regularizer": null, "nb_row": 5}}, {"class_name": "BatchNormalization", "config": {"gamma_regularizer": null, "epsilon": 0.001, "mode": 0, "trainable": true, "name": "batchnormalization_51", "axis": -1, "beta_regularizer": null, "momentum": 0.99}}, {"class_name": "Activation", "config": {"activation": "relu", "trainable": true, "name": "activation_115"}}, {"class_name": "MaxPooling2D", "config": {"strides": [2, 2], "dim_ordering": "tf", "trainable": true, "name": "maxpooling2d_47", "border_mode": "valid", "pool_size": [2, 2]}}, {"class_name": "Convolution2D", "config": {"init": "glorot_uniform", "subsample": [1, 1], "W_constraint": null, "trainable": true, "name": "convolution2d_80", "border_mode": "same", "activity_regularizer": null, "nb_col": 5, "nb_filter": 64, "dim_ordering": "tf", "bias": true, "W_regularizer": null, "activation": "linear", "b_constraint": null, "b_regularizer": null, "nb_row": 5}}, {"class_name": "BatchNormalization", "config": {"gamma_regularizer": null, "epsilon": 0.001, "mode": 0, "trainable": true, "name": "batchnormalization_52", "axis": -1, "beta_regularizer": null, "momentum": 0.99}}, {"class_name": "Activation", "config": {"activation": "relu", "trainable": true, "name": "activation_116"}}, {"class_name": "MaxPooling2D", "config": {"strides": [2, 2], "dim_ordering": "tf", "trainable": true, "name": "maxpooling2d_48", "border_mode": "valid", "pool_size": [2, 2]}}, {"class_name": "Dropout", "config": {"p": 0.5, "trainable": true, "name": "dropout_52"}}, {"class_name": "Flatten", "config": {"name": "flatten_16", "trainable": true}}, {"class_name": "Dropout", "config": {"p": 0.5, "trainable": true, "name": "dropout_53"}}, {"class_name": "Dense", "config": {"init": "glorot_uniform", "b_constraint": null, "W_constraint": null, "trainable": true, "name": "dense_49", "activity_regularizer": null, "output_dim": 256, "bias": true, "W_regularizer": null, "activation": "linear", "input_dim": 1600, "b_regularizer": null}}, {"class_name": "Activation", "config": {"activation": "elu", "trainable": true, "name": "activation_117"}}, {"class_name": "Dropout", "config": {"p": 0.5, "trainable": true, "name": "dropout_54"}}, {"class_name": "Dense", "config": {"init": "glorot_uniform", "b_constraint": null, "W_constraint": null, "trainable": true, "name": "dense_50", "activity_regularizer": null, "output_dim": 64, "bias": true, "W_regularizer": null, "activation": "linear", "input_dim": 256, "b_regularizer": null}}, {"class_name": "Activation", "config": {"activation": "elu", "trainable": true, "name": "activation_118"}}, {"class_name": "Dropout", "config": {"p": 0.5, "trainable": true, "name": "dropout_55"}}, {"class_name": "Dense", "config": {"init": "glorot_uniform", "b_constraint": null, "W_constraint": null, "trainable": true, "name": "dense_51", "activity_regularizer": null, "output_dim": 1, "bias": true, "W_regularizer": null, "activation": "linear", "input_dim": 64, "b_regularizer": null}}]}